import Mock from "mockjs"

Mock.mock('/api/v1/dataOverview', "get", {
    "msg": "数据返回正常！",
    "code": "0",
    "data": [{
        "amount": 25659,
        "whichTotal": "monthly",
        "taskAmount": 32445475,
        "amountCompleteRate": "69",
        "periodAmountRate": 1056,
        "previousPeriodAmountRate": -3.2
    }, {
        "amount": 2559,
        "whichTotal": "yearly",
        "taskAmount": 3275,
        "amountCompleteRate": "55",
        "periodAmountRate": 7.7,
        "previousPeriodAmountRate": -3.2
    }]
})
Mock.mock('/api/v1/departmentBriefing', "get", {
    "msg": "数据返回正常！",
    "code": "0",
    "data": {
        "secendPart": {
            "monthly": [{
                "category": "retailAmount",
                "charts": {
                    "columns": ["业务体", "目标", "实际", "达成率"],
                    "rows": [{"业务体": "TV", "目标": 10003, "实际": 13000, "达成率": 32}, {
                        "业务体": "冰洗",
                        "目标": 32325,
                        "实际": 12230,
                        "达成率": 26
                    }, {"业务体": "空调", "目标": 23133, "实际": 25346, "达成率": 46}, {
                        "业务体": "东芝",
                        "目标": 15337,
                        "实际": 14344,
                        "达成率": 49
                    }, {"业务体": "乐华", "目标": 43232, "实际": 32422, "达成率": 23}, {
                        "业务体": "健康电器",
                        "目标": 43422,
                        "实际": 42429,
                        "达成率": 100
                    }]
                },
                "tables": [["", "销售额", "月目标", "达成率", "同比", "均价"], ["TV", "1234567", "1234567", "181%", "+121%", "6680"], ["冰洗", "123456", "45456", "120%", "-323%", "2240"], ["空调", "12345", "84563", "911%", "+52%", "1220"], ["东芝", "34521", "45611", "617%", "+22%", "3230"], ["乐华的", "1415", "7828", "90%", "+80%", "2341"], ["健康电器", "221", "456", "13%", "-8%", "80"]]
            }, {
                "category": "retailCount",
                "charts": {
                    "columns": ["业务体", "目标", "实际", "达成率"],
                    "rows": [{"业务体": "TV", "目标": 4393, "实际": 1093, "达成率": 32}, {
                        "业务体": "冰洗",
                        "目标": 1530,
                        "实际": 3230,
                        "达成率": 26
                    }, {"业务体": "空调", "目标": 3923, "实际": 2623, "达成率": 46}, {
                        "业务体": "东芝",
                        "目标": 4723,
                        "实际": 1423,
                        "达成率": 49
                    }, {"业务体": "乐华", "目标": 1792, "实际": 3492, "达成率": 23}, {
                        "业务体": "健康电器",
                        "目标": 2593,
                        "实际": 4293,
                        "达成率": 100
                    }]
                },
                "tables": [["", "销售额", "月目标", "达成率", "同比"], ["TV", "1234567", "1234567", "181%", "+121%"], ["冰洗", "123456", "45456", "120%", "-323%"], ["空调", "12345", "84563", "911%", "+52%"], ["东芝", "34521", "45611", "617%", "+22%"], ["乐华的", "1415", "7828", "90%", "+80%"], ["健康电器", "221", "456", "13%", "-8%"]]
            }],
            "yearly": [{
                "category": "retailAmount",
                "charts": {
                    "columns": ["业务体", "目标", "实际", "达成率"],
                    "rows": [{"业务体": "TV", "目标": 4393, "实际": 5093, "达成率": 32}, {
                        "业务体": "冰洗",
                        "目标": 1530,
                        "实际": 7230,
                        "达成率": 26
                    }, {"业务体": "空调", "目标": 3923, "实际": 4623, "达成率": 46}, {
                        "业务体": "东芝",
                        "目标": 4723,
                        "实际": 7423,
                        "达成率": 49
                    }, {"业务体": "乐华", "目标": 7792, "实际": 3492, "达成率": 23}, {
                        "业务体": "健康电器",
                        "目标": 4593,
                        "实际": 4293,
                        "达成率": 100
                    }]
                },
                "tables": [["", "销售额", "年目标", "达成率", "同比", "均价"], ["TV", "1234567", "1234567", "181%", "+121%", "6680"], ["冰洗", "123456", "45456", "120%", "-323%", "2240"], ["空调", "12345", "84563", "911%", "+52%", "1220"], ["东芝", "34521", "45611", "617%", "+22%", "3230"], ["乐华的", "1415", "7828", "90%", "+80%", "2341"], ["健康电器", "221", "456", "13%", "-8%", "80"]]
            }, {
                "category": "retailCount",
                "charts": {
                    "columns": ["业务体", "目标", "实际", "达成率"],
                    "rows": [{"业务体": "TV", "目标": 2393, "实际": 3093, "达成率": 32}, {
                        "业务体": "冰洗",
                        "目标": 3530,
                        "实际": 3230,
                        "达成率": 26
                    }, {"业务体": "空调", "目标": 2923, "实际": 2623, "达成率": 46}, {
                        "业务体": "东芝",
                        "目标": 1723,
                        "实际": 1423,
                        "达成率": 49
                    }, {"业务体": "乐华", "目标": 4792, "实际": 3492, "达成率": 23}, {
                        "业务体": "健康电器",
                        "目标": 4593,
                        "实际": 4293,
                        "达成率": 100
                    }]
                },
                "tables": [["", "销售额", "年目标", "达成率", "同比"], ["TV", "1234567", "1234567", "181%", "+121%"], ["冰洗", "123456", "45456", "120%", "-323%"], ["空调", "12345", "84563", "911%", "+52%"], ["东芝", "34521", "45611", "617%", "+22%"], ["乐华的", "1415", "7828", "90%", "+80%"], ["健康电器", "221", "456", "13%", "-8%"]]
            }]
        }
    }
})
Mock.mock('/api/v1/bodyBriefing', "get", {
    "msg": "数据返回正常！",
    "code": "0",
    "data": {
        "thirdPart": {
            "monthly": [{
                "category": "retailAmount",
                "totalData": 18345,
                "charts": {
                    "columns": ["业务体", "达成率"],
                    "rows": [{"业务体": "京东", "达成率": 1393}, {"业务体": "淘系", "达成率": 5530}, {
                        "业务体": "连锁",
                        "达成率": 4923
                    }, {"业务体": "全品类", "达成率": 7723}, {"业务体": "其他", "达成率": 1792}]
                },
                "tables": [["", "零售额(万)", "月目标(万)", "达成率", "同比", "均价"], ["京东", "1234567", "1234567", "181%", "+121%", "6680"], ["淘系", "123456", "45456", "120%", "-323%", "2240"], ["连锁", "1415", "7828", "90%", "+80%", "2341"], ["全品类", "34521", "45611", "617%", "+22%", "3230"], ["其他", "221", "456", "13%", "-8%", "80"]]
            }, {
                "category": "retailCount",
                "totalData": 1000,
                "charts": {
                    "columns": ["业务体", "达成率"],
                    "rows": [{"业务体": "京东", "达成率": 8393}, {"业务体": "淘系", "达成率": 5530}, {
                        "业务体": "连锁",
                        "达成率": 2923
                    }, {"业务体": "全品类", "达成率": 3723}, {"业务体": "其他", "达成率": 2792}]
                },
                "tables": [["", "零售额(万台)", "年目标(万台)", "达成率", "同比"], ["京东", "1234567", "1234567", "181%", "+121%"], ["淘系", "123456", "45456", "120%", "-323%"], ["连锁", "1415", "7828", "90%", "+80%"], ["全品类", "34521", "45611", "617%", "+22%"], ["其他", "221", "456", "13%", "-8%"]]
            }],
            "yearly": [{
                "category": "retailAmount",
                "totalData": 28345,
                "charts": {
                    "columns": ["业务体", "达成率"],
                    "rows": [{"业务体": "京东", "达成率": 3393}, {"业务体": "淘系", "达成率": 9530}, {
                        "业务体": "连锁",
                        "达成率": 7923
                    }, {"业务体": "全品类", "达成率": 2723}, {"业务体": "其他", "达成率": 1792}]
                },
                "tables": [["", "零售额(亿)", "月目标(亿)", "达成率", "同比", "均价"], ["京东", "1234567", "1234567", "181%", "+121%", "6680"], ["淘系", "123456", "45456", "120%", "-323%", "2240"], ["连锁", "1415", "7828", "90%", "+80%", "2341"], ["全品类", "34521", "45611", "617%", "+22%", "3230"], ["其他", "221", "456", "13%", "-8%", "80"]]
            }, {
                "category": "retailCount",
                "totalData": 1000,
                "charts": {
                    "columns": ["业务体", "达成率"],
                    "rows": [{"业务体": "京东", "达成率": 8393}, {"业务体": "淘系", "达成率": 5530}, {
                        "业务体": "连锁",
                        "达成率": 4923
                    }, {"业务体": "全品类", "达成率": 3723}, {"业务体": "其他", "达成率": 2792}]
                },
                "tables": [["", "零售额(万台)", "年目标(万台)", "达成率", "同比"], ["京东", "12367", "14567", "181%", "+121%"], ["淘系", "123456", "45456", "120%", "-323%"], ["连锁", "1415", "7828", "90%", "+80%"], ["全品类", "34521", "45611", "617%", "+22%"], ["其他", "221", "456", "13%", "-8%"]]
            }]
        }
    }
})
